#!/usr/bin/env python3
# -*- coding: utf-8 -*-
# (c) @AlbertEinsteinTG

class Translation(object):
    
    START_TEXT = """
🤹ʜɪ ʜᴇʟᴏ {},🧸

ɪ ᴀᴍ ᴀ sɪᴍᴘʟᴇ ᴀᴅᴠᴀɴᴄᴇᴅ Aᴜᴛᴏ Fɪʟᴛᴇʀ Bᴏᴛ🏇

 📮Bᴏᴛ sɪᴍᴘʟʏ sᴇᴀʀᴄʜ ғᴏʀ ᴛʜᴇ ғɪʟᴇs ғʀᴏᴍ ᴘʀᴏᴠɪᴅᴇᴅ ᴄʜᴀɴɴᴇʟ ᴀᴄᴄᴏʀᴅɪɴɢ ᴛᴏ ɢɪᴠᴇɴ ᴏ̨ᴜᴇʀʏ ᴀɴᴅ ɢɪᴠᴇs ʟɪɴᴋ ᴛᴏ ᴛʜᴏsᴇ ғɪʟᴇs ᴀs ʙᴜᴛᴛᴏɴs!😉

 📜ғᴏʀ ᴍᴏʀᴇ ɪɴғᴏ /help ....🔭

🔬🧲© ᴄʀᴇᴀᴛᴏʀ : @DB_ROBOTS🎩,

---------------------------"""







    
    HELP_TEXT = """💡 𝐁𝐎𝐓'𝐒 𝐇𝐄𝐋𝐏
🚀ᴀᴅᴅ ʙᴏᴛ ᴛᴏ ʏᴏᴜʀ ɢʀᴏᴜᴘ ᴡɪᴛʜ ᴀᴅᴍɪɴ ʀɪɢʜᴛs.
🛸ᴀᴅᴅ ʙᴏᴛ ᴛᴏ ᴄʜᴀɴɴᴇʟs ᴡʜɪᴄʜ ʏᴏᴜ ᴡᴀɴᴛ ᴛᴏ ʟɪɴᴋ ᴡɪᴛʜ ᴀʟʟ ᴀᴅᴍɪɴ ʀɪɢʜᴛs!🏟️

⭕ 𝐌𝐲 𝐂𝐨𝐦𝐦𝐚𝐧𝐝𝐬 (ᴏɴʟʏ ᴡᴏʀᴋs ɪɴ ɢʀᴏᴜᴘ) 🏛
 ▶️ /add ᴄʜᴀᴛ_ɪᴅ  - Tᴏ Cᴏɴɴᴇᴄᴛ A Gʀᴏᴜᴘ Wɪᴛʜ A Cʜᴀɴɴᴇʟ <code>/add @Username</code>
 
 ▶️ /del ᴄʜᴀᴛ_ɪᴅ - Tᴏ ᴅɪsᴄᴏɴɴᴇᴄᴛ A Gʀᴏᴜᴘ Wɪᴛʜ A Cʜᴀɴɴᴇʟ <code>/del @Username</code>
 
 ▶️ /delall - Dɪsᴄᴏɴɴᴇᴄᴛ Aʟʟ Cᴏɴɴᴇᴄᴛᴇᴅ Cʜᴀɴɴᴇʟ Fɪʟᴇs Fʀᴏᴍ DB
 
 ▶️/settings - Bᴏᴛ's Sᴇᴛᴛɪɴɢs 
 
🔰 𝐒𝐄𝐓𝐓𝐈𝐍𝐆 𝐏𝐀𝐍𝐄𝐋
🔳 𝙲𝙷𝙰𝙽𝙽𝙴𝙻- ʟɪsᴛ ᴏғ ᴄᴏɴɴᴇᴄᴛᴇᴅ ᴄʜᴀɴɴᴇʟs ɪɴ ᴀ ɢʀᴏᴜᴘ.
🔳 𝙵𝙸𝙻𝚃𝙴𝚁 𝚃𝚈𝙿𝙴𝚂  -  ʟɪsᴛ ᴏғ ғɪʟᴛᴇʀ ᴛʏᴘᴇs. 
🔳 𝙲𝙾𝙽𝙵𝙸𝙶𝚄𝙴 - ᴄᴏɴғɪɢ ᴘᴀɢᴇ sᴇᴛᴛɪɴɢs.
🔳 𝚂𝚃𝙰𝚃𝚄𝚂 - ʙᴜᴛᴛᴏɴ ᴡɪʟʟ sʜᴏᴡs ᴛʜᴇ sᴛᴀᴛs ᴏғ ʏᴏᴜʀ ᴄʜᴀɴɴᴇʟ.

🔥Note :-
😅 ɴᴏ ɴᴇᴇᴅ ᴀᴅᴅ ᴇᴀᴄʜ ғɪʟᴛᴇʀ ᴀɢᴀɪɴ!📢
📯ʙᴏᴛ ᴡɪʟʟ ᴀᴜᴛᴏᴍᴀᴛɪᴄᴀʟʟʏ sᴇᴀʀᴄʜ ғᴏʀ ʏᴏᴜʀ ғɪʟᴇs ᴀɴᴅ ɢɪᴠᴇ ʟɪɴᴋs ᴛᴏ ᴛʜᴀᴛ!🗡️

•°•°•°•°•°•°•°•°•°•°•°•°•°•°•°•°•°•°•"""
    
    ABOUT_TEXT = """ 📕 𝐀𝐛𝐨𝐮𝐭 𝐌𝐞 ,⚔️

[°=°][°=°][°=°][°=°][°=°][°=°][°=°][°=°]

○ ᴍʏ ɴᴀᴍᴇ : υмя мονιєѕ ∂οиєя.

○ ʟᴀɴɢᴜᴀɢᴇ : ᴘʏᴛʜᴏɴ .

○ ғʀᴀᴍᴇᴡᴏʀᴋ : ᴘʏʀᴏɢʀᴀᴍ .

○ sᴇʀᴠᴇʀ : ʜᴇʀᴏᴋᴜ .

○ ᴠᴇʀsɪᴏɴ : 1.0.0.

○ ᴄʀᴇᴀᴛᴏʀ : @Deeks_04_8 🇮🇳

°^°^°^°^°^°^°^°^°^°^°^°^°^°^°^°^°^"""


    
    
    

    
